app/controllers/admin/content_controller.rb

SELECT `tags`.* FROM `tags` WHERE (name LIKE '%html%' ) ORDER BY name ASC
---
  def auto_complete_for_article_keywords
    @items = Tag.find_with_char params[:article][:keywords].strip

SELECT `redirects`.* FROM `redirects` WHERE `redirects`.`to_path` = 'http://localhost:4000/2011/09/20/test-blog-view' LIMIT 1
INSERT INTO `redirects` (`from_path`, `to_path`, `origin`) VALUES ('bTV6vC', 'http://localhost:4000/2011/09/20/test-blog-view', NULL)
---
  def set_shortened_url
    # In a very short time, I'd like to have permalink modification generate a 301 redirect as well to
    # So I set this up the big way now

    return unless Redirect.find_by_to_path(@article.permalink_url).nil?

    red = Redirect.new
    red.from_path = red.shorten
    red.to_path = @article.permalink_url
    red.save