app/controllers/admin/sidebar_controller.rb

  def index
    @available = available
    # Reset the staged position based on the active position.
    Sidebar.delete_all('active_position is null')
---
DELETE FROM `sidebars` WHERE (active_position is null)

  def set_active
    # Get all available plugins
    klass_for = available.inject({}) do |hash, klass|
      hash.merge({ klass.short_name => klass })
    end

    # Get all already active plugins
    activemap = flash_sidebars.inject({}) do |h, sb_id|
      sb = Sidebar.find(sb_id.to_i)
      sb ? h.merge(sb.html_id => sb_id) : h
    end

    # Figure out which plugins are referenced by the params[:active] array and
    # lay them out in a easy accessible sequential array
    flash[:sidebars] = params[:active].map do |name|
      if klass_for.has_key?(name)
        new_sidebar_id = klass_for[name].create.id
---
SELECT `sidebars`.* FROM `sidebars` WHERE `sidebars`.`id` = 2 LIMIT 1
SELECT `sidebars`.* FROM `sidebars` ORDER BY active_position ASC
INSERT INTO `sidebars` (`active_position`, `config`, `staged_position`, `type`) VALUES (NULL, '---\nmaximum_tags: 20\n', NULL, 'TagSidebar')

  def publish
    Sidebar.transaction do
      position = 0
      params[:configure] ||= { }
      # Crappy workaround to rails update_all bug with PgSQL / SQLite
      ActiveRecord::Base.connection.execute("update sidebars set active_position=null")
      flash_sidebars.each do |id|
        sidebar = Sidebar.find(id)
        sb_attribs = params[:configure][id.to_s] || {}
        # If it's a checkbox and unchecked, convert the 0 to false
        # This is ugly.  Anyone have an improvement?
        sidebar.fields.each do |field|
          sb_attribs[field.key] = field.canonicalize(sb_attribs[field.key])
        end

        sidebar.update_attributes(:config => sb_attribs,
                                  :active_position => position)
        position += 1
      end
      Sidebar.delete_all('active_position is null')
---
UPDATE `sidebars` SET `active_position` = 0, `config` = '---\ncount: true\nempty: false\n' WHERE `sidebars`.`type` = 'CategorySidebar' AND `sidebars`.`id` = 2
DELETE FROM `sidebars` WHERE (active_position is null)